pub const UPPERCASE_LETTER: [[&str; 24]; 2] = [
    [
        "Α", "Β", "Γ", "Δ", "Ε", "Ζ", "Η", "Θ", "Ι", "Κ", "Λ", "Μ", "Ν", "Ξ", "Ο", "Π", "Ρ", "Σ",
        "Τ", "Υ", "Φ", "Χ", "Ψ", "Ω",
    ],
    [
        "A", "V", "G", "D", "E", "Z", "Ī", "TH", "I", "K", "L", "M", "N", "X", "O", "P", "R", "S",
        "T", "Y", "F", "CH", "PS", "Ō",
    ],
];

pub const LOWERCASE_LETTER: [[&str; 25]; 2] = [
    [
        "α", "β", "γ", "δ", "ε", "ζ", "η", "θ", "ι", "κ", "λ", "μ", "ν", "ξ", "ο", "π", "ρ", "σ",
        "τ", "υ", "φ", "χ", "ψ", "ω", "ς",
    ],
    [
        "a", "v", "g", "d", "e", "z", "ī", "th", "i", "k", "l", "m", "n", "x", "o", "p", "r", "s",
        "t", "y", "f", "ch", "ps", "ō", "s",
    ],
];

pub const ACCENT_VOWEL: [[&str; 20]; 2] = [
    [
        "Ά", "ά", "Έ", "έ", "Ή", "ή", "Ί", "ί", "Ϊ", "ϊ", "ΐ", "Ό", "ό", "Ύ", "ύ", "Ϋ", "ϋ", "ΰ",
        "Ώ", "ώ",
    ],
    [
        "Á", "á", "É", "é", "Ī́", "ī́", "Í", "í", "Ï", "ï", "ḯ", "Ó", "ó", "Ý", "ý", "Ÿ", "ÿ", "ÿ́",
        "Ṓ", "ṓ",
    ],
];

pub const EXCEPTION: [[&str; 24]; 2] = [
    [
        "ΑΥ", "Αυ", "αΥ", "αυ", "ΕΥ", "Ευ", "εΥ", "ευ", "ΟΥ", "Ου", "οΥ", "ου", "ΑΎ", "Αύ", "αΎ",
        "αύ", "ΕΎ", "Εύ", "εΎ", "εύ", "ΟΎ", "Ού", "οΎ", "ού",
    ],
    [
        "AU", "Au", "aU", "au", "EU", "Eu", "eU", "eu", "OU", "Ou", "oU", "ou", "AÚ", "Aú", "aÚ",
        "aú", "EÚ", "Eú", "eÚ", "eú", "OÚ", "Oú", "oÚ", "oú",
    ],
];
